## Central Alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                   NAME                                   |
|----------|--------------------------------------------------------------------------|
| delete   | `module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda`       |
|          | `module.notify_slack.aws_iam_policy.notify_slack_lambda`                 |
|          | `module.notify_slack.aws_iam_role.notify_slack_lambda`                   |
|          | `module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda` |
|          | `module.notify_slack.aws_lambda_function.notify_slack`                   |
|          | `module.notify_slack.aws_lambda_permission.notify_slack[0]`              |
| recreate | `aws_sns_topic_subscription.cloudwatch_alarm`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sns_topic_subscription.cloudwatch_alarm must be replaced
-/+ resource "aws_sns_topic_subscription" "cloudwatch_alarm" {
      ~ arn                             = "arn:aws:sns:ca-central-1:871282759583:cbs-cloudwatch-alarm:929eb023-2a24-4362-8b8f-a2e5ae6f75ae" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ endpoint                        = (sensitive) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:871282759583:cbs-cloudwatch-alarm:929eb023-2a24-4362-8b8f-a2e5ae6f75ae" -> (known after apply)
      ~ owner_id                        = "871282759583" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ protocol                        = "lambda" -> "https" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda will be destroyed
  # (because aws_cloudwatch_log_group.notify_slack_lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:871282759583:log-group:/aws/lambda/cbs-notify-slack" -> null
      - id                = "/aws/lambda/cbs-notify-slack" -> null
      - name              = "/aws/lambda/cbs-notify-slack" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "cbs-871282759583"
        } -> null
      - tags_all          = {
          - "CostCentre" = "cbs-871282759583"
        } -> null
    }

  # module.notify_slack.aws_iam_policy.notify_slack_lambda will be destroyed
  # (because aws_iam_policy.notify_slack_lambda is not in configuration)
  - resource "aws_iam_policy" "notify_slack_lambda" {
      - arn       = "arn:aws:iam::871282759583:policy/NotifySlackLambda-cbs-notify-slack" -> null
      - id        = "arn:aws:iam::871282759583:policy/NotifySlackLambda-cbs-notify-slack" -> null
      - name      = "NotifySlackLambda-cbs-notify-slack" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:871282759583:log-group:/aws/lambda/cbs-notify-slack"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4VXD726PTBFLRZL57" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.notify_slack.aws_iam_role.notify_slack_lambda will be destroyed
  # (because aws_iam_role.notify_slack_lambda is not in configuration)
  - resource "aws_iam_role" "notify_slack_lambda" {
      - arn                   = "arn:aws:iam::871282759583:role/NotifySlackLambda-cbs-notify-slack" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-10-31T15:24:58Z" -> null
      - force_detach_policies = false -> null
      - id                    = "NotifySlackLambda-cbs-notify-slack" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::871282759583:policy/NotifySlackLambda-cbs-notify-slack",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "NotifySlackLambda-cbs-notify-slack" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2022-12-19T15:40:58Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA4VXD726P4KLXIU4RK" -> null

      - inline_policy {}
    }

  # module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda will be destroyed
  # (because aws_iam_role_policy_attachment.notify_slack_lambda is not in configuration)
  - resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      - id         = "NotifySlackLambda-cbs-notify-slack-20221031152459139800000001" -> null
      - policy_arn = "arn:aws:iam::871282759583:policy/NotifySlackLambda-cbs-notify-slack" -> null
      - role       = "NotifySlackLambda-cbs-notify-slack" -> null
    }

  # module.notify_slack.aws_lambda_function.notify_slack will be destroyed
  # (because aws_lambda_function.notify_slack is not in configuration)
  - resource "aws_lambda_function" "notify_slack" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:871282759583:function:cbs-notify-slack" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "Lambda function to post CloudWatch alarm notifications to a Slack channel." -> null
      - filename                       = "/tmp/notify_slack.py.zip" -> null
      - function_name                  = "cbs-notify-slack" -> null
      - handler                        = "notify_slack.lambda_handler" -> null
      - id                             = "cbs-notify-slack" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:871282759583:function:cbs-notify-slack/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-10-31T15:25:13.125+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:871282759583:function:cbs-notify-slack:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:871282759583:function:cbs-notify-slack:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::871282759583:role/NotifySlackLambda-cbs-notify-slack" -> null
      - runtime                        = "python3.8" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "iC0Ta5b8fs9u6i/c3LA3/Tk8BUHfS6Jgq4NF8At0CBo=" -> null
      - source_code_size               = 1613 -> null
      - tags                           = {
          - "CostCentre" = "cbs-871282759583"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "cbs-871282759583"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "LOG_EVENTS"        = "True"
              - "PROJECT_NAME"      = "871282759583"
              - "SLACK_WEBHOOK_URL" = (sensitive)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] will be destroyed
  # (because aws_lambda_permission.notify_slack is not in configuration)
  - resource "aws_lambda_permission" "notify_slack" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "cbs-notify-slack" -> null
      - id            = "AllowExecutionFromSNS-cbs-notify-slack-0" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:871282759583:cbs-cloudwatch-alarm" -> null
      - statement_id  = "AllowExecutionFromSNS-cbs-notify-slack-0" -> null
    }

Plan: 1 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.no_transport_lambda_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.transport_lambda_error"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
